
import asyncio
from aiogram import Bot, Dispatcher, types
from aiogram.filters import Command

API_TOKEN = "8262846851:AAEV5wWiSYRvKa87WPb_EIsPYJJsM2FSPpw"

PARTNER_LINK = "https://lkys.cc/defd"

bot = Bot(token=API_TOKEN)
dp = Dispatcher()

@dp.message(Command("start"))
async def start(message: types.Message):
    text = (
        "🏰 Добро пожаловать в Tower Rush — уникальную стратегическую игру, где каждый ход может увеличить твои награды! "
        "Используя проверенные стратегии, ты можешь минимизировать риски и получать удовольствие от игры, наблюдая, как твоя башня растёт и приносит бонусы. "
        "Не упусти шанс получить бонус при пополнении и увеличить свои возможности с самого начала. "
        "⚠️ Игра предназначена только для игроков старше 18 лет.\n\n"
        f"👉 Начни играть прямо сейчас: {PARTNER_LINK}"
    )
    
    await message.answer(text)

async def main():
    await dp.start_polling(bot)

if __name__ == "__main__":
    asyncio.run(main())

